/**Основные семантические теги предназначены для упрощения работы поисковых роботов
 * <main> Определения основного контента страницы</main>
 * <header>«шапка» страницы или раздела</header>
 * <nav>задает навигацию по сайту</nav>
 * <section>для группировки разделов</section>
 * <article>пост на форуме, статья в журнале или газете, заметка в блоге</article>
 * <aside>блок сбоку от контента для размещения рубрик, ссылок на архив, меток </aside>
 * <audio>добавляет, воспроизводит и управляет настройками аудиозаписи на веб-странице</audio>
 * <video>добавляет, воспроизводит и управляет настройками видеозаписи на веб-странице</video>
 * <canvas>область, в которой при помощи JavaScript можно рисовать разные объекты,</canvas>
 * <footer>задает «подвал» сайта или раздела</footer>
 * <menu><command>Элемент может иметь вид кнопки, переключателя или флажка <menu></menu>
 * <datalist>список вариантов, которые можно выбирать при наборе в текстовом поле</datalist>
 * <details>хранения информации, тогл изменения статуса применяется атрибут open</details>
 * <embed>используется для загрузки и отображения объектов 
 * <hgroup>для группирования заголовков веб-страницы</hgroup>
 * <keygen> для шифрования и расшифровки данных форм
 * <mark>помечает текст как выделенный</mark>
 * <meter>отображения числовых значений: количества результатов поиска, объема жидкости</meter>
 * <output> определяет область, в которую выводится информация,</output>
 * <progress>для отображения прогресса завершенности задачи</progress>
 * <ruby>вместе с <rt> и <rp> небольшой аннотации сверху или снизу</ruby>
 * <time>как дата, время или оба значения</time>
 * <wbr>указывает браузеру место, где допускается делать перенос строки
 */
