const aboutUserData = {
  name: "Ruslan Gubin",
  text: "Привет, я веб-разработчик, с середины мая 2022 я начал изучать програмирование, первые месяцы обучения были посвящены css, html БЭМ-методология правильное построение компонентов блоков, было много создано шпаргалок и одностраничный сайтов по обучающим роликам, работал с прикольными анимациями. в июне сделал полноценный портфолио сайт где впервые внедрил технологию javascript, которая отвечал за отображение перевод на английский, swiper менял изображение в начале сайта, и плавный переход по странице, на то время сборщик проекта был gulp, gulp - конвертировал изображение на webp ели у пользователя был подходящий браузер, работал со шрифтами, в общем сжимал все до мелочей. После портфолио я посвятил все время изучению javascript, также были небольшие обучающиеся проекты, 15 июля сборщик webpack и свой первый js проект интернет магазин на нативном js, это был ооп подход, также параллельно собрал сервер на Node.js где взаимодействовал с сайтом, там уже можно было создать товар, удалить, получить отфильтрованный массив по поиску, добавление комментария жалобы и удаление,  уже поинтересней. В августе  начал создавать этот сайт. Это мой первый проект на React , тут я уже описал в отделе ниже все технологии, пришлось разобраться с backend поглубже и добавилось технологий frontenda, в соседнем отделе я опишу  возможности сайта,  хотелось бы еще добавить в будущем нормальную админку и еще много идей.  На данный момент ищу работу удаленно,  хотелось бы получить опыт работы с командой, опытных менторов, интересные задачи и обучатся новому.",
  test: "впервые внедрил технологию javascript, впервые внедрпервые внедрил технологию javascript, ",
};

const aboutSitePosts = [
  'Авторизация пользователя',
  'Вход пользователя',
  'Изменение пользователя',
  'Удаление пользователя',
  'Добавление и удаление постов',
  'Изменение постов',
  'Счетчик просмотров постов',
  'Лайк постов и комментариев',
  'Дизлайк постов и комментариев',
  'Просмотр количество лайков',
  'Добавление коментрия к посту',
  'Удаление коментрия к посту',
  'Изменение коментрия к посту',
  'Отображение и переход на страницу коментария',
  'Добавление пользователя в друзья',
  'Удаление пользователя из друзей',
  'Отказ пользователя в друзья',
  'Ожидание пользователя в друзья',
  'Диалог между пользователями',
  'Удаление диалога между пользователями',
  'Поиск по имени пользователя',
  'Поиск по заголовку поста',
  'Фильтрация поиска личных постов',
  'Фильтрация и отображение выделенного тега',
]

const aboutSiteProduct = [
  'Переход в отдел товаров',
  'Фильтрация товара по категориям',
  'Пагинация',
  'Добавление Товара до 5 изображений',
  'Замена и изменение товара и изображение',
  'Удаление товара',
  'Добавление в корзину',
  'Проверка количество товара перед покупкой',
  'Создание удаление комментария товара',
  'Заполнение Visa и обработка заказа',
]

export { aboutUserData, aboutSitePosts, aboutSiteProduct};
